#pragma once
#include "pch.h"
#include <map>
#include <string>

class Device
{
public:
	Device();
	const std::map<int, std::string> codes_cell // Расшифровка кодов Линейная ячейка
	{
		{1,"АВ включен"},{2,"АВ отключен"},{3,"Нет питания АВ"},{4,"Есть питание АВ"},
		{5,"Команда на включение АВ"},{6,"Команда на отключение АВ"},{7,"Неисправность АВ"},
		{8,"Авария АВ"},{9,"Положение АВ не определено"},{10,"ПЗШ на ЗШ"},
		{11,"ПЗШ на ОШ"},{12,"Нет питания ПЗШ"},
		{13,"Есть питание ПЗШ"},{14,"Положение ПЗШ не определено"},{15,"Неисправность ПЗШ"},
		{16,"Команда на перевод ПЗШ на ЗШ"},{17,"Команда на перевод ПЗШ на ОШ"},{18,"Перевод ПЗШ соседней ячейки на ЗШ диспетчером"},
		{19,"Перевод ПЗШ соседней ячейки на ОШ диспетчером"},{20,"АВ включен диспетчером"},
		{21,"АВ отключен диспетчером"},{22,"ПЗШ переведен на ЗШ диспетчером"},{23,"ПЗШ переведен на ОШ диспетчером"},
		{24,"Включен автоматический режим"},{25,"Автоматический режим отключен"},
		{26,"Была нажата кнопка 'Отключить АВ'"},{27,"Была нажата кнопка 'Квитирование звонка'"},{28,"Была нажата кнопка 'Проверка АПВ'"},
		{29,"Отсутствует напряжение на шине"},{31,"Сработала звуковая сигнализация"},
		{32,"Сработала ТЗКС"},{33,"Сработала ЗЗ"},{34,"Команда на включение ЛНС"},
		{35,"Отключение ЛНС"},{36,"Блокировка АПВ"},{37,"Команда на перевод ПЗШ на ЗШ соседа"},
		{38,"Команда на перевод ПЗШ на ОШ соседа"},{54,"ОшибкаПЛК"},
		{55,"Ошибка регистратора"},{61,"Успешный запуск системы"},
		{100,"DgnPLC: ОРИ или отказ CMOS05"},{101,"DgnPLC:Ошибка чтения файла с РП"},
		{102,"DgnPLC:Не норма РП"},{103,"DgnPLC:Отказ часов реального времени (RTC)"},
		{104,"DgnPLC:Высокая скорость обмена через PC104 не устанавливается - модуль ПЛК не работоспособен"},
		{105,"DgnPLC:Резерв 5"},{106,"DgnPLC:Превышение максимального времени скана"},{107,"DgnPLC:Резерв 7"},
		{108,"DgnPLC:Останов РП от команды СТП(применяется пользователем)"},{109,"DgnPLC:Ошибка ввода-вывода (ОВВ) в главном каркасе"},
		{110,"DgnPLC:Ненорма самопроверки UART C750 для расширителей или ненорма передатчика в процессе РП"},{111,"DgnPLC:Нет связи с одним из расширителей"},
		{112,"DgnPLC:Ошибка ввода-вывода в каркасе одного из расширителей"},{113,"DgnPLC:Ошибка обмена Modbus TCP/IP/Ethernet"},
		{114,"DgnPLC:Ошибка сетевой диагностики модуля"},{115,"DgnPLC:Резрв 15"}
	};


	std::map<int, std::string> codes_aggregate // Расшифровка кодов Агрегат
	{
		{1,"Включен режим АТ"},{2,"Включен режим АМ"},{3,"Включен режим РМ"},{4,"ВА отключен"},{5,"ВА включен"},
		{6,"ВА неопределен"},{7,"Авария ВА "},{8,"Нажата кнопка ВКЛ ВА"},{9,"Нажата кнопка ОТКЛ ВА"},
		{10,"Команда ТУ 'Отключить ВА'"},{11,"Команда ТУ 'Включить ВА'"},{12,"Предупреждение о превышении температуры БВК1"},
		{13,"Предупреждение о превышении температуры БВК2"},{14,"Перегрев БВК1"},{15,"Перегрев БВК2"},
		{16,"Команда 'Включение резерва' по перегреву БВК1"},{17,"Команда 'Включение резерва' по перегреву БВК2"},
		{18,"Команда 'Включение резерва' по перегрузке"},{19,"Газовая защита"},{20,"Газовая сигнализация"},
		{21,"Земляная защита"},{22,"Максимальная токовая защита"},{23,"Разбаланс диодов a1"},{24,"Разбаланс диодов a4"},
		{25,"Разбаланс диодов b3"},{26,""},{27,""},{28,""},{29,""},{30,""},{31,""},
		{32,""},{33,""},{34,""},{35,""},{36,""},{37,""},{38,""},{39,""},{40,""},{41,""},{42,""},{43,""},
		{44,""},{54,""},{55,""},{100,""},{101,""},{102,""},{103,""},{104,""},{105,""},{106,""},
		{107,""},{108,""},{109,""},{110,""},{111,""},{112,""},{113,""},{114,""},{115,""}
	};
	std::map<int, std::string> codes_control2 // Расшифровка кодов Шкаф управления ВВ2
	{
		{1,""},{2,""},{3,""},{4,""},{5,""},{6,""},{7,""},{8,""},{9,""},{10,""},{11,""},{12,""},
		{13,""},{14,""},{15,""},{16,""},{17,""},{18,""},{19,""},{20,""},{21,""},{22,""},{23,""},{24,""},
		{25,""},{26,""},{27,""},{28,""},{29,""},{30,""},{31,""},
		{32,""},{33,""},{34,""},{35,""},{54,""},{55,""},{56,""},{58,""},{59,""},{61,""},
		{100,""},{101,""},{102,""},{103,""},{104,""},{105,""},{106,""},
		{107,""},{108,""},{109,""},{110,""},{111,""},{112,""},{113,""},{114,""},{115,""}
	};
	std::map<int, std::string> codes_control3_tp4 // Расшифровка кодов Шкаф управления ВВ3 ТП4
	{
		{1,""},{2,""},{3,""},{4,""},{8,""},{9,""},{12,""},
		{13,""},{14,""},{15,""},{16,""},{17,""},{18,""},{19,""},{20,""},{21,""},{22,""},{23,""},{24,""},
		{25,""},{26,""},{27,""},{28,""},{29,""},{30,""},{31,""},
		{32,""},{33,""},{34,""},{35,""},{36,""},{37,""},{38,""},{39,""},{40,""},{41,""},{42,""},{43,""},
		{44,""},{45,""},{46,""},{47,""},{48,""},{49,""},{50,""},{51,""},{52,""},{53,""},
		{54,""},{55,""},{56,""},{57,""},{58,""},{59,""},{60,""},{61,""},{62,""},{63,""},{64,""},
		{65,""},{66,""},{67,""},
		{100,""},{101,""},{102,""},{103,""},{104,""},{105,""},{106,""},
		{107,""},{108,""},{109,""},{110,""},{111,""},{112,""},{113,""},{114,""},{115,""}
	};
	std::map<int, std::string> codes_control3_tp41 // Расшифровка кодов Шкаф управления ВВ3 ТП41
	{
		{1,""},{2,""},{3,""},{4,""},{8,""},{9,""},{12,""},
		{13,""},{14,""},{15,""},{16,""},{17,""},{18,""},{19,""},{20,""},{21,""},{22,""},{23,""},{24,""},
		{25,""},{26,""},{27,""},{28,""},{29,""},{30,""},{31,""},
		{32,""},{33,""},{34,""},{35,""},{36,""},{37,""},{38,""},{39,""},{40,""},{41,""},{42,""},{43,""},
		{44,""},{45,""},{46,""},{47,""},{48,""},{49,""},{50,""},{51,""},{52,""},{53,""},
		{54,""},{55,""},{56,""},{57,""},{58,""},{59,""},{60,""},{61,""},{62,""},{63,""},{64,""},
		{65,""},{66,""},{67,""},
		{100,""},{101,""},{102,""},{103,""},{104,""},{105,""},{106,""},
		{107,""},{108,""},{109,""},{110,""},{111,""},{112,""},{113,""},{114,""},{115,""}
	};
	std::map<int, std::string> codes_control3_tp16 // Расшифровка кодов Шкаф управления ВВ3 ТП16
	{
		{1,""},{2,""},{3,""},{4,""},{8,""},{9,""},{12,""},
		{13,""},{14,""},{15,""},{16,""},{17,""},{18,""},{19,""},{20,""},{21,""},{22,""},{23,""},{24,""},
		{25,""},{26,""},{27,""},{28,""},{29,""},{30,""},{31,""},
		{32,""},{33,""},{34,""},{35,""},{36,""},{37,""},{38,""},{39,""},{40,""},{41,""},{42,""},{43,""},
		{44,""},{45,""},{46,""},{47,""},{48,""},{49,""},{50,""},{51,""},{52,""},{53,""},
		{54,""},{55,""},{56,""},{57,""},{58,""},{59,""},{60,""},{61,""},{62,""},{63,""},{64,""},
		{65,""},{66,""},{67,""},
		{100,""},{101,""},{102,""},{103,""},{104,""},{105,""},{106,""},
		{107,""},{108,""},{109,""},{110,""},{111,""},{112,""},{113,""},{114,""},{115,""}
	};

private:
	~Device();
};

